АлогистикТест2/src/Documents/алк_ЧисленныйСоставСмены/алк_ЧисленныйСоставСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЧисленныйСоставСмены</name>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подрядчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСотрудника</name>
      <type>
        <types>CatalogRef.алк_СтатусыСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЧисленныйСоставСмены/ManagerModule.bsl
//Функция для получения Структуры для заполнения при создании документа 
//
Функция ПолучитьСтруктуруЗаполнения_СоздатьДокумент() Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	
	СтруктураЗаполнения.Вставить("ДатаСмены");
	СтруктураЗаполнения.Вставить("Смена");
	СтруктураЗаполнения.Вставить("Участок", Неопределено);
	СтруктураЗаполнения.Вставить("Направление", Неопределено);
	СтруктураЗаполнения.Вставить("Бригада");
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

Функция ПолучитьСоставСмены(ПараметрыЗаполнения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЧисленныйСоставСмены.Ссылка
		|ПОМЕСТИТЬ втДокументы
		|ИЗ
		|	Документ.алк_ЧисленныйСоставСмены КАК алк_ЧисленныйСоставСмены
		|ГДЕ
		|	алк_ЧисленныйСоставСмены.Смена = &Смена
		|	И алк_ЧисленныйСоставСмены.ДатаСмены = &ДатаСмены
		|	И ВЫБОР
		|			КОГДА &Направление = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ алк_ЧисленныйСоставСмены.Ссылка.Направление = &Направление
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Участок = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ алк_ЧисленныйСоставСмены.Ссылка.Участок = &Участок
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЧисленныйСоставСменыПерсонал.ФизическоеЛицо КАК ФизическоеЛицо,
		|	алк_ЧисленныйСоставСменыПерсонал.Должность,
		|	алк_ЧисленныйСоставСменыПерсонал.СтатусСотрудника КАК СтатусСотрудника
		|ИЗ
		|	Документ.алк_ЧисленныйСоставСмены.Персонал КАК алк_ЧисленныйСоставСменыПерсонал
		|ГДЕ
		|	алк_ЧисленныйСоставСменыПерсонал.Ссылка.Ссылка В
		|			(ВЫБРАТЬ
		|				втДокументы.Ссылка
		|			ИЗ
		|				втДокументы КАК втДокументы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЧисленныйСоставСменыТранспорт.ТранспортноеСредство
		|ИЗ
		|	Документ.алк_ЧисленныйСоставСмены.Транспорт КАК алк_ЧисленныйСоставСменыТранспорт
		|ГДЕ
		|	алк_ЧисленныйСоставСменыТранспорт.Ссылка.Ссылка В
		|			(ВЫБРАТЬ
		|				втДокументы.Ссылка
		|			ИЗ
		|				втДокументы КАК втДокументы)";
	
	Запрос.УстановитьПараметр("ДатаСмены", ПараметрыЗаполнения.ДатаСмены);
	Запрос.УстановитьПараметр("Направление", ПараметрыЗаполнения.Направление);
	Запрос.УстановитьПараметр("Участок", ПараметрыЗаполнения.Участок);
	Запрос.УстановитьПараметр("Смена", ПараметрыЗаполнения.Смена);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗПерсонал = РезультатЗапроса[1].Выгрузить();
	ТЗТранспорт = РезультатЗапроса[2].Выгрузить();	

	ТЗРезультат = Новый Структура;
	ТЗРезультат.Вставить("Персонал", ТЗПерсонал);
	ТЗРезультат.Вставить("Транспорт", ТЗТранспорт);
	
	Возврат ТЗРезультат;	
		
КонецФункции
